program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3304.5.2"}, {"coremlc-version", "3304.6.2"}, {"coremltools-component-torch", "2.4.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "7.2"}})]
{
    func main<ios15>(tensor<fp32, [1, 3, 640, 640]> image) {
            tensor<fp32, []> image__scaled___y_0 = const()[name = tensor<string, []>("image__scaled___y_0"), val = tensor<fp32, []>(0x1.010102p-8)];
            tensor<fp32, [1, 3, 640, 640]> image__scaled__ = mul(x = image, y = image__scaled___y_0)[name = tensor<string, []>("image__scaled__")];
            tensor<int32, []> var_39 = const()[name = tensor<string, []>("op_39"), val = tensor<int32, []>(1)];
            tensor<int32, [2]> var_46 = const()[name = tensor<string, []>("op_46"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_48 = const()[name = tensor<string, []>("op_48"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_1_pad_type_0 = const()[name = tensor<string, []>("input_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_1_pad_0 = const()[name = tensor<string, []>("input_1_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<string, []> image_to_fp16_dtype_0 = const()[name = tensor<string, []>("image_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [16, 3, 3, 3]> model_0_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_0_conv_weight_to_fp16"), val = tensor<fp16, [16, 3, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [16]> model_0_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_0_conv_bias_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1024)))];
            tensor<fp16, [1, 3, 640, 640]> cast_8 = cast(dtype = image_to_fp16_dtype_0, x = image__scaled__)[name = tensor<string, []>("cast_8")];
            tensor<fp16, [1, 16, 320, 320]> input_1_cast_fp16 = conv(bias = model_0_conv_bias_to_fp16, dilations = var_48, groups = var_39, pad = input_1_pad_0, pad_type = input_1_pad_type_0, strides = var_46, weight = model_0_conv_weight_to_fp16, x = cast_8)[name = tensor<string, []>("input_1_cast_fp16")];
            tensor<fp16, []> input_3_alpha_0_to_fp16 = const()[name = tensor<string, []>("input_3_alpha_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, []> input_3_beta_0_to_fp16 = const()[name = tensor<string, []>("input_3_beta_0_to_fp16"), val = tensor<fp16, []>(0x1.8p+2)];
            tensor<fp16, [1, 16, 320, 320]> input_3_cast_fp16 = clip(alpha = input_3_alpha_0_to_fp16, beta = input_3_beta_0_to_fp16, x = input_1_cast_fp16)[name = tensor<string, []>("input_3_cast_fp16")];
            tensor<int32, []> var_55 = const()[name = tensor<string, []>("op_55"), val = tensor<int32, []>(1)];
            tensor<int32, [2]> var_62 = const()[name = tensor<string, []>("op_62"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_64 = const()[name = tensor<string, []>("op_64"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_5_pad_type_0 = const()[name = tensor<string, []>("input_5_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_5_pad_0 = const()[name = tensor<string, []>("input_5_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [32, 16, 3, 3]> model_1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_1_conv_weight_to_fp16"), val = tensor<fp16, [32, 16, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1152)))];
            tensor<fp16, [32]> model_1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_1_conv_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10432)))];
            tensor<fp16, [1, 32, 160, 160]> input_5_cast_fp16 = conv(bias = model_1_conv_bias_to_fp16, dilations = var_64, groups = var_55, pad = input_5_pad_0, pad_type = input_5_pad_type_0, strides = var_62, weight = model_1_conv_weight_to_fp16, x = input_3_cast_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<fp16, []> input_7_alpha_0_to_fp16 = const()[name = tensor<string, []>("input_7_alpha_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, []> input_7_beta_0_to_fp16 = const()[name = tensor<string, []>("input_7_beta_0_to_fp16"), val = tensor<fp16, []>(0x1.8p+2)];
            tensor<fp16, [1, 32, 160, 160]> input_7_cast_fp16 = clip(alpha = input_7_alpha_0_to_fp16, beta = input_7_beta_0_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<int32, []> var_72 = const()[name = tensor<string, []>("op_72"), val = tensor<int32, []>(1)];
            tensor<int32, [2]> var_82 = const()[name = tensor<string, []>("op_82"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_84 = const()[name = tensor<string, []>("op_84"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_9_pad_type_0 = const()[name = tensor<string, []>("input_9_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_9_pad_0 = const()[name = tensor<string, []>("input_9_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 32, 1, 1]> model_2_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_2_cv1_conv_weight_to_fp16"), val = tensor<fp16, [32, 32, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10560)))];
            tensor<fp16, [32]> model_2_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_2_cv1_conv_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12672)))];
            tensor<fp16, [1, 32, 160, 160]> input_9_cast_fp16 = conv(bias = model_2_cv1_conv_bias_to_fp16, dilations = var_84, groups = var_72, pad = input_9_pad_0, pad_type = input_9_pad_type_0, strides = var_82, weight = model_2_cv1_conv_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("input_9_cast_fp16")];
            tensor<fp16, []> var_87_alpha_0_to_fp16 = const()[name = tensor<string, []>("op_87_alpha_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, []> var_87_beta_0_to_fp16 = const()[name = tensor<string, []>("op_87_beta_0_to_fp16"), val = tensor<fp16, []>(0x1.8p+2)];
            tensor<fp16, [1, 32, 160, 160]> var_87_cast_fp16 = clip(alpha = var_87_alpha_0_to_fp16, beta = var_87_beta_0_to_fp16, x = input_9_cast_fp16)[name = tensor<string, []>("op_87_cast_fp16")];
            tensor<int32, [2]> var_88 = const()[name = tensor<string, []>("op_88"), val = tensor<int32, [2]>([16, 16])];
            tensor<int32, []> var_89_axis_0 = const()[name = tensor<string, []>("op_89_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 16, 160, 160]> var_89_cast_fp16_0, tensor<fp16, [1, 16, 160, 160]> var_89_cast_fp16_1 = split(axis = var_89_axis_0, split_sizes = var_88, x = var_87_cast_fp16)[name = tensor<string, []>("op_89_cast_fp16")];
            tensor<int32, [2]> var_97 = const()[name = tensor<string, []>("op_97"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_99 = const()[name = tensor<string, []>("op_99"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_13_pad_type_0 = const()[name = tensor<string, []>("input_13_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_13_pad_0 = const()[name = tensor<string, []>("input_13_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [16, 16, 3, 3]> model_2_m_0_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_2_m_0_cv1_conv_weight_to_fp16"), val = tensor<fp16, [16, 16, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12800)))];
            tensor<fp16, [16]> model_2_m_0_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_2_m_0_cv1_conv_bias_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(17472)))];
            tensor<fp16, [1, 16, 160, 160]> input_13_cast_fp16 = conv(bias = model_2_m_0_cv1_conv_bias_to_fp16, dilations = var_99, groups = var_72, pad = input_13_pad_0, pad_type = input_13_pad_type_0, strides = var_97, weight = model_2_m_0_cv1_conv_weight_to_fp16, x = var_89_cast_fp16_1)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<fp16, []> input_15_alpha_0_to_fp16 = const()[name = tensor<string, []>("input_15_alpha_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, []> input_15_beta_0_to_fp16 = const()[name = tensor<string, []>("input_15_beta_0_to_fp16"), val = tensor<fp16, []>(0x1.8p+2)];
            tensor<fp16, [1, 16, 160, 160]> input_15_cast_fp16 = clip(alpha = input_15_alpha_0_to_fp16, beta = input_15_beta_0_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("input_15_cast_fp16")];
            tensor<int32, [2]> var_106 = const()[name = tensor<string, []>("op_106"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_108 = const()[name = tensor<string, []>("op_108"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_17_pad_type_0 = const()[name = tensor<string, []>("input_17_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_17_pad_0 = const()[name = tensor<string, []>("input_17_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [16, 16, 3, 3]> model_2_m_0_cv2_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_2_m_0_cv2_conv_weight_to_fp16"), val = tensor<fp16, [16, 16, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(17600)))];
            tensor<fp16, [16]> model_2_m_0_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_2_m_0_cv2_conv_bias_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(22272)))];
            tensor<fp16, [1, 16, 160, 160]> input_17_cast_fp16 = conv(bias = model_2_m_0_cv2_conv_bias_to_fp16, dilations = var_108, groups = var_72, pad = input_17_pad_0, pad_type = input_17_pad_type_0, strides = var_106, weight = model_2_m_0_cv2_conv_weight_to_fp16, x = input_15_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<fp16, []> var_111_alpha_0_to_fp16 = const()[name = tensor<string, []>("op_111_alpha_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, []> var_111_beta_0_to_fp16 = const()[name = tensor<string, []>("op_111_beta_0_to_fp16"), val = tensor<fp16, []>(0x1.8p+2)];
            tensor<fp16, [1, 16, 160, 160]> var_111_cast_fp16 = clip(alpha = var_111_alpha_0_to_fp16, beta = var_111_beta_0_to_fp16, x = input_17_cast_fp16)[name = tensor<string, []>("op_111_cast_fp16")];
            tensor<fp16, [1, 16, 160, 160]> var_112_cast_fp16 = add(x = var_89_cast_fp16_1, y = var_111_cast_fp16)[name = tensor<string, []>("op_112_cast_fp16")];
            tensor<bool, []> input_19_interleave_0 = const()[name = tensor<string, []>("input_19_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 48, 160, 160]> input_19_cast_fp16 = concat(axis = var_72, interleave = input_19_interleave_0, values = (var_89_cast_fp16_0, var_89_cast_fp16_1, var_112_cast_fp16))[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<int32, [2]> var_118 = const()[name = tensor<string, []>("op_118"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_120 = const()[name = tensor<string, []>("op_120"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_21_pad_type_0 = const()[name = tensor<string, []>("input_21_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_21_pad_0 = const()[name = tensor<string, []>("input_21_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 48, 1, 1]> model_2_cv2_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_2_cv2_conv_weight_to_fp16"), val = tensor<fp16, [32, 48, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(22400)))];
            tensor<fp16, [32]> model_2_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_2_cv2_conv_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25536)))];
            tensor<fp16, [1, 32, 160, 160]> input_21_cast_fp16 = conv(bias = model_2_cv2_conv_bias_to_fp16, dilations = var_120, groups = var_72, pad = input_21_pad_0, pad_type = input_21_pad_type_0, strides = var_118, weight = model_2_cv2_conv_weight_to_fp16, x = input_19_cast_fp16)[name = tensor<string, []>("input_21_cast_fp16")];
            tensor<fp16, []> input_23_alpha_0_to_fp16 = const()[name = tensor<string, []>("input_23_alpha_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, []> input_23_beta_0_to_fp16 = const()[name = tensor<string, []>("input_23_beta_0_to_fp16"), val = tensor<fp16, []>(0x1.8p+2)];
            tensor<fp16, [1, 32, 160, 160]> input_23_cast_fp16 = clip(alpha = input_23_alpha_0_to_fp16, beta = input_23_beta_0_to_fp16, x = input_21_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<int32, []> var_127 = const()[name = tensor<string, []>("op_127"), val = tensor<int32, []>(1)];
            tensor<int32, [2]> var_134 = const()[name = tensor<string, []>("op_134"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_136 = const()[name = tensor<string, []>("op_136"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_25_pad_type_0 = const()[name = tensor<string, []>("input_25_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_25_pad_0 = const()[name = tensor<string, []>("input_25_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [64, 32, 3, 3]> model_3_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_3_conv_weight_to_fp16"), val = tensor<fp16, [64, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25664)))];
            tensor<fp16, [64]> model_3_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_3_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(62592)))];
            tensor<fp16, [1, 64, 80, 80]> input_25_cast_fp16 = conv(bias = model_3_conv_bias_to_fp16, dilations = var_136, groups = var_127, pad = input_25_pad_0, pad_type = input_25_pad_type_0, strides = var_134, weight = model_3_conv_weight_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<fp16, []> input_27_alpha_0_to_fp16 = const()[name = tensor<string, []>("input_27_alpha_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, []> input_27_beta_0_to_fp16 = const()[name = tensor<string, []>("input_27_beta_0_to_fp16"), val = tensor<fp16, []>(0x1.8p+2)];
            tensor<fp16, [1, 64, 80, 80]> input_27_cast_fp16 = clip(alpha = input_27_alpha_0_to_fp16, beta = input_27_beta_0_to_fp16, x = input_25_cast_fp16)[name = tensor<string, []>("input_27_cast_fp16")];
            tensor<int32, []> var_144 = const()[name = tensor<string, []>("op_144"), val = tensor<int32, []>(1)];
            tensor<int32, [2]> var_156 = const()[name = tensor<string, []>("op_156"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_158 = const()[name = tensor<string, []>("op_158"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_29_pad_type_0 = const()[name = tensor<string, []>("input_29_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_29_pad_0 = const()[name = tensor<string, []>("input_29_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 64, 1, 1]> model_4_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_4_cv1_conv_weight_to_fp16"), val = tensor<fp16, [64, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(62784)))];
            tensor<fp16, [64]> model_4_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_4_cv1_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(71040)))];
            tensor<fp16, [1, 64, 80, 80]> input_29_cast_fp16 = conv(bias = model_4_cv1_conv_bias_to_fp16, dilations = var_158, groups = var_144, pad = input_29_pad_0, pad_type = input_29_pad_type_0, strides = var_156, weight = model_4_cv1_conv_weight_to_fp16, x = input_27_cast_fp16)[name = tensor<string, []>("input_29_cast_fp16")];
            tensor<fp16, []> var_161_alpha_0_to_fp16 = const()[name = tensor<string, []>("op_161_alpha_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, []> var_161_beta_0_to_fp16 = const()[name = tensor<string, []>("op_161_beta_0_to_fp16"), val = tensor<fp16, []>(0x1.8p+2)];
            tensor<fp16, [1, 64, 80, 80]> var_161_cast_fp16 = clip(alpha = var_161_alpha_0_to_fp16, beta = var_161_beta_0_to_fp16, x = input_29_cast_fp16)[name = tensor<string, []>("op_161_cast_fp16")];
            tensor<int32, [2]> var_162 = const()[name = tensor<string, []>("op_162"), val = tensor<int32, [2]>([32, 32])];
            tensor<int32, []> var_163_axis_0 = const()[name = tensor<string, []>("op_163_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 32, 80, 80]> var_163_cast_fp16_0, tensor<fp16, [1, 32, 80, 80]> var_163_cast_fp16_1 = split(axis = var_163_axis_0, split_sizes = var_162, x = var_161_cast_fp16)[name = tensor<string, []>("op_163_cast_fp16")];
            tensor<int32, [2]> var_171 = const()[name = tensor<string, []>("op_171"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_173 = const()[name = tensor<string, []>("op_173"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_33_pad_type_0 = const()[name = tensor<string, []>("input_33_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_33_pad_0 = const()[name = tensor<string, []>("input_33_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [32, 32, 3, 3]> model_4_m_0_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_4_m_0_cv1_conv_weight_to_fp16"), val = tensor<fp16, [32, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(71232)))];
            tensor<fp16, [32]> model_4_m_0_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_4_m_0_cv1_conv_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(89728)))];
            tensor<fp16, [1, 32, 80, 80]> input_33_cast_fp16 = conv(bias = model_4_m_0_cv1_conv_bias_to_fp16, dilations = var_173, groups = var_144, pad = input_33_pad_0, pad_type = input_33_pad_type_0, strides = var_171, weight = model_4_m_0_cv1_conv_weight_to_fp16, x = var_163_cast_fp16_1)[name = tensor<string, []>("input_33_cast_fp16")];
            tensor<fp16, []> input_35_alpha_0_to_fp16 = const()[name = tensor<string, []>("input_35_alpha_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, []> input_35_beta_0_to_fp16 = const()[name = tensor<string, []>("input_35_beta_0_to_fp16"), val = tensor<fp16, []>(0x1.8p+2)];
            tensor<fp16, [1, 32, 80, 80]> input_35_cast_fp16 = clip(alpha = input_35_alpha_0_to_fp16, beta = input_35_beta_0_to_fp16, x = input_33_cast_fp16)[name = tensor<string, []>("input_35_cast_fp16")];
            tensor<int32, [2]> var_180 = const()[name = tensor<string, []>("op_180"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_182 = const()[name = tensor<string, []>("op_182"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_37_pad_type_0 = const()[name = tensor<string, []>("input_37_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_37_pad_0 = const()[name = tensor<string, []>("input_37_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [32, 32, 3, 3]> model_4_m_0_cv2_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_4_m_0_cv2_conv_weight_to_fp16"), val = tensor<fp16, [32, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(89856)))];
            tensor<fp16, [32]> model_4_m_0_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_4_m_0_cv2_conv_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(108352)))];
            tensor<fp16, [1, 32, 80, 80]> input_37_cast_fp16 = conv(bias = model_4_m_0_cv2_conv_bias_to_fp16, dilations = var_182, groups = var_144, pad = input_37_pad_0, pad_type = input_37_pad_type_0, strides = var_180, weight = model_4_m_0_cv2_conv_weight_to_fp16, x = input_35_cast_fp16)[name = tensor<string, []>("input_37_cast_fp16")];
            tensor<fp16, []> var_185_alpha_0_to_fp16 = const()[name = tensor<string, []>("op_185_alpha_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, []> var_185_beta_0_to_fp16 = const()[name = tensor<string, []>("op_185_beta_0_to_fp16"), val = tensor<fp16, []>(0x1.8p+2)];
            tensor<fp16, [1, 32, 80, 80]> var_185_cast_fp16 = clip(alpha = var_185_alpha_0_to_fp16, beta = var_185_beta_0_to_fp16, x = input_37_cast_fp16)[name = tensor<string, []>("op_185_cast_fp16")];
            tensor<fp16, [1, 32, 80, 80]> input_39_cast_fp16 = add(x = var_163_cast_fp16_1, y = var_185_cast_fp16)[name = tensor<string, []>("input_39_cast_fp16")];
            tensor<int32, [2]> var_192 = const()[name = tensor<string, []>("op_192"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_194 = const()[name = tensor<string, []>("op_194"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_41_pad_type_0 = const()[name = tensor<string, []>("input_41_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_41_pad_0 = const()[name = tensor<string, []>("input_41_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [32, 32, 3, 3]> model_4_m_1_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_4_m_1_cv1_conv_weight_to_fp16"), val = tensor<fp16, [32, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(108480)))];
            tensor<fp16, [32]> model_4_m_1_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_4_m_1_cv1_conv_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(126976)))];
            tensor<fp16, [1, 32, 80, 80]> input_41_cast_fp16 = conv(bias = model_4_m_1_cv1_conv_bias_to_fp16, dilations = var_194, groups = var_144, pad = input_41_pad_0, pad_type = input_41_pad_type_0, strides = var_192, weight = model_4_m_1_cv1_conv_weight_to_fp16, x = input_39_cast_fp16)[name = tensor<string, []>("input_41_cast_fp16")];
            tensor<fp16, []> input_43_alpha_0_to_fp16 = const()[name = tensor<string, []>("input_43_alpha_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, []> input_43_beta_0_to_fp16 = const()[name = tensor<string, []>("input_43_beta_0_to_fp16"), val = tensor<fp16, []>(0x1.8p+2)];
            tensor<fp16, [1, 32, 80, 80]> input_43_cast_fp16 = clip(alpha = input_43_alpha_0_to_fp16, beta = input_43_beta_0_to_fp16, x = input_41_cast_fp16)[name = tensor<string, []>("input_43_cast_fp16")];
            tensor<int32, [2]> var_201 = const()[name = tensor<string, []>("op_201"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_203 = const()[name = tensor<string, []>("op_203"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_45_pad_type_0 = const()[name = tensor<string, []>("input_45_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_45_pad_0 = const()[name = tensor<string, []>("input_45_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [32, 32, 3, 3]> model_4_m_1_cv2_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_4_m_1_cv2_conv_weight_to_fp16"), val = tensor<fp16, [32, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(127104)))];
            tensor<fp16, [32]> model_4_m_1_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_4_m_1_cv2_conv_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(145600)))];
            tensor<fp16, [1, 32, 80, 80]> input_45_cast_fp16 = conv(bias = model_4_m_1_cv2_conv_bias_to_fp16, dilations = var_203, groups = var_144, pad = input_45_pad_0, pad_type = input_45_pad_type_0, strides = var_201, weight = model_4_m_1_cv2_conv_weight_to_fp16, x = input_43_cast_fp16)[name = tensor<string, []>("input_45_cast_fp16")];
            tensor<fp16, []> var_206_alpha_0_to_fp16 = const()[name = tensor<string, []>("op_206_alpha_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, []> var_206_beta_0_to_fp16 = const()[name = tensor<string, []>("op_206_beta_0_to_fp16"), val = tensor<fp16, []>(0x1.8p+2)];
            tensor<fp16, [1, 32, 80, 80]> var_206_cast_fp16 = clip(alpha = var_206_alpha_0_to_fp16, beta = var_206_beta_0_to_fp16, x = input_45_cast_fp16)[name = tensor<string, []>("op_206_cast_fp16")];
            tensor<fp16, [1, 32, 80, 80]> var_207_cast_fp16 = add(x = input_39_cast_fp16, y = var_206_cast_fp16)[name = tensor<string, []>("op_207_cast_fp16")];
            tensor<bool, []> input_47_interleave_0 = const()[name = tensor<string, []>("input_47_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 128, 80, 80]> input_47_cast_fp16 = concat(axis = var_144, interleave = input_47_interleave_0, values = (var_163_cast_fp16_0, var_163_cast_fp16_1, input_39_cast_fp16, var_207_cast_fp16))[name = tensor<string, []>("input_47_cast_fp16")];
            tensor<int32, [2]> var_213 = const()[name = tensor<string, []>("op_213"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_215 = const()[name = tensor<string, []>("op_215"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_49_pad_type_0 = const()[name = tensor<string, []>("input_49_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_49_pad_0 = const()[name = tensor<string, []>("input_49_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 128, 1, 1]> model_4_cv2_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_4_cv2_conv_weight_to_fp16"), val = tensor<fp16, [64, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(145728)))];
            tensor<fp16, [64]> model_4_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_4_cv2_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(162176)))];
            tensor<fp16, [1, 64, 80, 80]> input_49_cast_fp16 = conv(bias = model_4_cv2_conv_bias_to_fp16, dilations = var_215, groups = var_144, pad = input_49_pad_0, pad_type = input_49_pad_type_0, strides = var_213, weight = model_4_cv2_conv_weight_to_fp16, x = input_47_cast_fp16)[name = tensor<string, []>("input_49_cast_fp16")];
            tensor<fp16, []> input_51_alpha_0_to_fp16 = const()[name = tensor<string, []>("input_51_alpha_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, []> input_51_beta_0_to_fp16 = const()[name = tensor<string, []>("input_51_beta_0_to_fp16"), val = tensor<fp16, []>(0x1.8p+2)];
            tensor<fp16, [1, 64, 80, 80]> input_51_cast_fp16 = clip(alpha = input_51_alpha_0_to_fp16, beta = input_51_beta_0_to_fp16, x = input_49_cast_fp16)[name = tensor<string, []>("input_51_cast_fp16")];
            tensor<int32, []> var_222 = const()[name = tensor<string, []>("op_222"), val = tensor<int32, []>(1)];
            tensor<int32, [2]> var_229 = const()[name = tensor<string, []>("op_229"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_231 = const()[name = tensor<string, []>("op_231"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_53_pad_type_0 = const()[name = tensor<string, []>("input_53_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_53_pad_0 = const()[name = tensor<string, []>("input_53_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [128, 64, 3, 3]> model_5_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_5_conv_weight_to_fp16"), val = tensor<fp16, [128, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(162368)))];
            tensor<fp16, [128]> model_5_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_5_conv_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(309888)))];
            tensor<fp16, [1, 128, 40, 40]> input_53_cast_fp16 = conv(bias = model_5_conv_bias_to_fp16, dilations = var_231, groups = var_222, pad = input_53_pad_0, pad_type = input_53_pad_type_0, strides = var_229, weight = model_5_conv_weight_to_fp16, x = input_51_cast_fp16)[name = tensor<string, []>("input_53_cast_fp16")];
            tensor<fp16, []> input_55_alpha_0_to_fp16 = const()[name = tensor<string, []>("input_55_alpha_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, []> input_55_beta_0_to_fp16 = const()[name = tensor<string, []>("input_55_beta_0_to_fp16"), val = tensor<fp16, []>(0x1.8p+2)];
            tensor<fp16, [1, 128, 40, 40]> input_55_cast_fp16 = clip(alpha = input_55_alpha_0_to_fp16, beta = input_55_beta_0_to_fp16, x = input_53_cast_fp16)[name = tensor<string, []>("input_55_cast_fp16")];
            tensor<int32, []> var_239 = const()[name = tensor<string, []>("op_239"), val = tensor<int32, []>(1)];
            tensor<int32, [2]> var_251 = const()[name = tensor<string, []>("op_251"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_253 = const()[name = tensor<string, []>("op_253"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_57_pad_type_0 = const()[name = tensor<string, []>("input_57_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_57_pad_0 = const()[name = tensor<string, []>("input_57_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [128, 128, 1, 1]> model_6_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_6_cv1_conv_weight_to_fp16"), val = tensor<fp16, [128, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(310208)))];
            tensor<fp16, [128]> model_6_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_6_cv1_conv_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(343040)))];
            tensor<fp16, [1, 128, 40, 40]> input_57_cast_fp16 = conv(bias = model_6_cv1_conv_bias_to_fp16, dilations = var_253, groups = var_239, pad = input_57_pad_0, pad_type = input_57_pad_type_0, strides = var_251, weight = model_6_cv1_conv_weight_to_fp16, x = input_55_cast_fp16)[name = tensor<string, []>("input_57_cast_fp16")];
            tensor<fp16, []> var_256_alpha_0_to_fp16 = const()[name = tensor<string, []>("op_256_alpha_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, []> var_256_beta_0_to_fp16 = const()[name = tensor<string, []>("op_256_beta_0_to_fp16"), val = tensor<fp16, []>(0x1.8p+2)];
            tensor<fp16, [1, 128, 40, 40]> var_256_cast_fp16 = clip(alpha = var_256_alpha_0_to_fp16, beta = var_256_beta_0_to_fp16, x = input_57_cast_fp16)[name = tensor<string, []>("op_256_cast_fp16")];
            tensor<int32, [2]> var_257 = const()[name = tensor<string, []>("op_257"), val = tensor<int32, [2]>([64, 64])];
            tensor<int32, []> var_258_axis_0 = const()[name = tensor<string, []>("op_258_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 64, 40, 40]> var_258_cast_fp16_0, tensor<fp16, [1, 64, 40, 40]> var_258_cast_fp16_1 = split(axis = var_258_axis_0, split_sizes = var_257, x = var_256_cast_fp16)[name = tensor<string, []>("op_258_cast_fp16")];
            tensor<int32, [2]> var_266 = const()[name = tensor<string, []>("op_266"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_268 = const()[name = tensor<string, []>("op_268"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_61_pad_type_0 = const()[name = tensor<string, []>("input_61_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_61_pad_0 = const()[name = tensor<string, []>("input_61_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [64, 64, 3, 3]> model_6_m_0_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_6_m_0_cv1_conv_weight_to_fp16"), val = tensor<fp16, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(343360)))];
            tensor<fp16, [64]> model_6_m_0_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_6_m_0_cv1_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(417152)))];
            tensor<fp16, [1, 64, 40, 40]> input_61_cast_fp16 = conv(bias = model_6_m_0_cv1_conv_bias_to_fp16, dilations = var_268, groups = var_239, pad = input_61_pad_0, pad_type = input_61_pad_type_0, strides = var_266, weight = model_6_m_0_cv1_conv_weight_to_fp16, x = var_258_cast_fp16_1)[name = tensor<string, []>("input_61_cast_fp16")];
            tensor<fp16, []> input_63_alpha_0_to_fp16 = const()[name = tensor<string, []>("input_63_alpha_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, []> input_63_beta_0_to_fp16 = const()[name = tensor<string, []>("input_63_beta_0_to_fp16"), val = tensor<fp16, []>(0x1.8p+2)];
            tensor<fp16, [1, 64, 40, 40]> input_63_cast_fp16 = clip(alpha = input_63_alpha_0_to_fp16, beta = input_63_beta_0_to_fp16, x = input_61_cast_fp16)[name = tensor<string, []>("input_63_cast_fp16")];
            tensor<int32, [2]> var_275 = const()[name = tensor<string, []>("op_275"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_277 = const()[name = tensor<string, []>("op_277"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_65_pad_type_0 = const()[name = tensor<string, []>("input_65_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_65_pad_0 = const()[name = tensor<string, []>("input_65_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [64, 64, 3, 3]> model_6_m_0_cv2_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_6_m_0_cv2_conv_weight_to_fp16"), val = tensor<fp16, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(417344)))];
            tensor<fp16, [64]> model_6_m_0_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_6_m_0_cv2_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(491136)))];
            tensor<fp16, [1, 64, 40, 40]> input_65_cast_fp16 = conv(bias = model_6_m_0_cv2_conv_bias_to_fp16, dilations = var_277, groups = var_239, pad = input_65_pad_0, pad_type = input_65_pad_type_0, strides = var_275, weight = model_6_m_0_cv2_conv_weight_to_fp16, x = input_63_cast_fp16)[name = tensor<string, []>("input_65_cast_fp16")];
            tensor<fp16, []> var_280_alpha_0_to_fp16 = const()[name = tensor<string, []>("op_280_alpha_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, []> var_280_beta_0_to_fp16 = const()[name = tensor<string, []>("op_280_beta_0_to_fp16"), val = tensor<fp16, []>(0x1.8p+2)];
            tensor<fp16, [1, 64, 40, 40]> var_280_cast_fp16 = clip(alpha = var_280_alpha_0_to_fp16, beta = var_280_beta_0_to_fp16, x = input_65_cast_fp16)[name = tensor<string, []>("op_280_cast_fp16")];
            tensor<fp16, [1, 64, 40, 40]> input_67_cast_fp16 = add(x = var_258_cast_fp16_1, y = var_280_cast_fp16)[name = tensor<string, []>("input_67_cast_fp16")];
            tensor<int32, [2]> var_287 = const()[name = tensor<string, []>("op_287"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_289 = const()[name = tensor<string, []>("op_289"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_69_pad_type_0 = const()[name = tensor<string, []>("input_69_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_69_pad_0 = const()[name = tensor<string, []>("input_69_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [64, 64, 3, 3]> model_6_m_1_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_6_m_1_cv1_conv_weight_to_fp16"), val = tensor<fp16, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(491328)))];
            tensor<fp16, [64]> model_6_m_1_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_6_m_1_cv1_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(565120)))];
            tensor<fp16, [1, 64, 40, 40]> input_69_cast_fp16 = conv(bias = model_6_m_1_cv1_conv_bias_to_fp16, dilations = var_289, groups = var_239, pad = input_69_pad_0, pad_type = input_69_pad_type_0, strides = var_287, weight = model_6_m_1_cv1_conv_weight_to_fp16, x = input_67_cast_fp16)[name = tensor<string, []>("input_69_cast_fp16")];
            tensor<fp16, []> input_71_alpha_0_to_fp16 = const()[name = tensor<string, []>("input_71_alpha_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, []> input_71_beta_0_to_fp16 = const()[name = tensor<string, []>("input_71_beta_0_to_fp16"), val = tensor<fp16, []>(0x1.8p+2)];
            tensor<fp16, [1, 64, 40, 40]> input_71_cast_fp16 = clip(alpha = input_71_alpha_0_to_fp16, beta = input_71_beta_0_to_fp16, x = input_69_cast_fp16)[name = tensor<string, []>("input_71_cast_fp16")];
            tensor<int32, [2]> var_296 = const()[name = tensor<string, []>("op_296"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_298 = const()[name = tensor<string, []>("op_298"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_73_pad_type_0 = const()[name = tensor<string, []>("input_73_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_73_pad_0 = const()[name = tensor<string, []>("input_73_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [64, 64, 3, 3]> model_6_m_1_cv2_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_6_m_1_cv2_conv_weight_to_fp16"), val = tensor<fp16, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(565312)))];
            tensor<fp16, [64]> model_6_m_1_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_6_m_1_cv2_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(639104)))];
            tensor<fp16, [1, 64, 40, 40]> input_73_cast_fp16 = conv(bias = model_6_m_1_cv2_conv_bias_to_fp16, dilations = var_298, groups = var_239, pad = input_73_pad_0, pad_type = input_73_pad_type_0, strides = var_296, weight = model_6_m_1_cv2_conv_weight_to_fp16, x = input_71_cast_fp16)[name = tensor<string, []>("input_73_cast_fp16")];
            tensor<fp16, []> var_301_alpha_0_to_fp16 = const()[name = tensor<string, []>("op_301_alpha_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, []> var_301_beta_0_to_fp16 = const()[name = tensor<string, []>("op_301_beta_0_to_fp16"), val = tensor<fp16, []>(0x1.8p+2)];
            tensor<fp16, [1, 64, 40, 40]> var_301_cast_fp16 = clip(alpha = var_301_alpha_0_to_fp16, beta = var_301_beta_0_to_fp16, x = input_73_cast_fp16)[name = tensor<string, []>("op_301_cast_fp16")];
            tensor<fp16, [1, 64, 40, 40]> var_302_cast_fp16 = add(x = input_67_cast_fp16, y = var_301_cast_fp16)[name = tensor<string, []>("op_302_cast_fp16")];
            tensor<bool, []> input_75_interleave_0 = const()[name = tensor<string, []>("input_75_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 256, 40, 40]> input_75_cast_fp16 = concat(axis = var_239, interleave = input_75_interleave_0, values = (var_258_cast_fp16_0, var_258_cast_fp16_1, input_67_cast_fp16, var_302_cast_fp16))[name = tensor<string, []>("input_75_cast_fp16")];
            tensor<int32, [2]> var_308 = const()[name = tensor<string, []>("op_308"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_310 = const()[name = tensor<string, []>("op_310"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_77_pad_type_0 = const()[name = tensor<string, []>("input_77_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_77_pad_0 = const()[name = tensor<string, []>("input_77_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [128, 256, 1, 1]> model_6_cv2_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_6_cv2_conv_weight_to_fp16"), val = tensor<fp16, [128, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(639296)))];
            tensor<fp16, [128]> model_6_cv2_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_6_cv2_conv_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(704896)))];
            tensor<fp16, [1, 128, 40, 40]> input_77_cast_fp16 = conv(bias = model_6_cv2_conv_bias_to_fp16, dilations = var_310, groups = var_239, pad = input_77_pad_0, pad_type = input_77_pad_type_0, strides = var_308, weight = model_6_cv2_conv_weight_to_fp16, x = input_75_cast_fp16)[name = tensor<string, []>("input_77_cast_fp16")];
            tensor<fp16, []> input_79_alpha_0_to_fp16 = const()[name = tensor<string, []>("input_79_alpha_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, []> input_79_beta_0_to_fp16 = const()[name = tensor<string, []>("input_79_beta_0_to_fp16"), val = tensor<fp16, []>(0x1.8p+2)];
            tensor<fp16, [1, 128, 40, 40]> input_79_cast_fp16 = clip(alpha = input_79_alpha_0_to_fp16, beta = input_79_beta_0_to_fp16, x = input_77_cast_fp16)[name = tensor<string, []>("input_79_cast_fp16")];
            tensor<int32, []> var_317 = const()[name = tensor<string, []>("op_317"), val = tensor<int32, []>(1)];
            tensor<int32, [2]> var_324 = const()[name = tensor<string, []>("op_324"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_326 = const()[name = tensor<string, []>("op_326"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_81_pad_type_0 = const()[name = tensor<string, []>("input_81_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_81_pad_0 = const()[name = tensor<string, []>("input_81_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [256, 128, 3, 3]> model_7_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_7_conv_weight_to_fp16"), val = tensor<fp16, [256, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(705216)))];
            tensor<fp16, [256]> model_7_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_7_conv_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1295104)))];
            tensor<fp16, [1, 256, 20, 20]> input_81_cast_fp16 = conv(bias = model_7_conv_bias_to_fp16, dilations = var_326, groups = var_317, pad = input_81_pad_0, pad_type = input_81_pad_type_0, strides = var_324, weight = model_7_conv_weight_to_fp16, x = input_79_cast_fp16)[name = tensor<string, []>("input_81_cast_fp16")];
            tensor<fp16, []> input_83_alpha_0_to_fp16 = const()[name = tensor<string, []>("input_83_alpha_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, []> input_83_beta_0_to_fp16 = const()[name = tensor<string, []>("input_83_beta_0_to_fp16"), val = tensor<fp16, []>(0x1.8p+2)];
            tensor<fp16, [1, 256, 20, 20]> input_83_cast_fp16 = clip(alpha = input_83_alpha_0_to_fp16, beta = input_83_beta_0_to_fp16, x = input_81_cast_fp16)[name = tensor<string, []>("input_83_cast_fp16")];
            tensor<int32, []> var_334 = const()[name = tensor<string, []>("op_334"), val = tensor<int32, []>(1)];
            tensor<int32, [2]> var_344 = const()[name = tensor<string, []>("op_344"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_346 = const()[name = tensor<string, []>("op_346"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_85_pad_type_0 = const()[name = tensor<string, []>("input_85_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_85_pad_0 = const()[name = tensor<string, []>("input_85_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [256, 256, 1, 1]> model_8_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_8_cv1_conv_weight_to_fp16"), val = tensor<fp16, [256, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1295680)))];
            tensor<fp16, [256]> model_8_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_8_cv1_conv_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1426816)))];
            tensor<fp16, [1, 256, 20, 20]> input_85_cast_fp16 = conv(bias = model_8_cv1_conv_bias_to_fp16, dilations = var_346, groups = var_334, pad = input_85_pad_0, pad_type = input_85_pad_type_0, strides = var_344, weight = model_8_cv1_conv_weight_to_fp16, x = input_83_cast_fp16)[name = tensor<string, []>("input_85_cast_fp16")];
            tensor<fp16, []> var_349_alpha_0_to_fp16 = const()[name = tensor<string, []>("op_349_alpha_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, []> var_349_beta_0_to_fp16 = const()[name = tensor<string, []>("op_349_beta_0_to_fp16"), val = tensor<fp16, []>(0x1.8p+2)];
            tensor<fp16, [1, 256, 20, 20]> var_349_cast_fp16 = clip(alpha = var_349_alpha_0_to_fp16, beta = var_349_beta_0_to_fp16, x = input_85_cast_fp16)[name = tensor<string, []>("op_349_cast_fp16")];
            tensor<int32, [2]> var_350 = const()[name = tensor<string, []>("op_350"), val = tensor<int32, [2]>([128, 128])];
            tensor<int32, []> var_351_axis_0 = const()[name = tensor<string, []>("op_351_axis_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 128, 20, 20]> var_351_cast_fp16_0, tensor<fp16, [1, 128, 20, 20]> var_351_cast_fp16_1 = split(axis = var_351_axis_0, split_sizes = var_350, x = var_349_cast_fp16)[name = tensor<string, []>("op_351_cast_fp16")];
            tensor<int32, [2]> var_359 = const()[name = tensor<string, []>("op_359"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_361 = const()[name = tensor<string, []>("op_361"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_89_pad_type_0 = const()[name = tensor<string, []>("input_89_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_89_pad_0 = const()[name = tensor<string, []>("input_89_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [128, 128, 3, 3]> model_8_m_0_cv1_conv_weight_to_fp16 = const()[name = tensor<string, []>("model_8_m_0_cv1_conv_weight_to_fp16"), val = tensor<fp16, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1427392)))];
            tensor<fp16, [128]> model_8_m_0_cv1_conv_bias_to_fp16 = const()[name = tensor<string, []>("model_8_m_0_cv1_conv_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1722368)))];
            tensor<fp16, [1, 128, 20, 20]> input_89_cast_fp16 = conv(bias = model_8_m_0_cv1_conv_bias_to_fp16, dilations = var_361, groups = var_334, pad = input_89_pad_0, pad_type = input_89_pad_type_0, strides = var_359, weight = model_8_m_0_cv1_conv_weight_to_fp16, x = var_351_cast_fp16_1)[name = tensor<string, []>("input_89_cast_fp16")];
